ansible/pgbench_results/pgbench_read_only_result_cnpg.txt
pgbench (18.3 (Ubuntu 18.3-1.pgdg24.04+1), server 18.1 (Debian 18.1-1.pgdg13+2))
transaction type: <builtin: select only>
scaling factor: 300
query mode: simple
number of clients: 295
number of threads: 8
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 1344779
number of failed transactions: 0 (0.000%)
latency average = 6.285 ms
initial connection time = 1677.633 ms
tps = 46939.074622 (without initial connection time)