ansible/pgbench_results/pgbench_read_only_result_pg.txt
pgbench (18.3 (Ubuntu 18.3-1.pgdg24.04+1))
transaction type: <builtin: select only>
scaling factor: 300
query mode: simple
number of clients: 295
number of threads: 8
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 1874804
number of failed transactions: 0 (0.000%)
latency average = 4.504 ms
initial connection time = 1741.010 ms
tps = 65493.787274 (without initial connection time)