ansible/pgbench_results/pgbench_result_pg.txt
pgbench (18.3 (Ubuntu 18.3-1.pgdg24.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 300
query mode: simple
number of clients: 295
number of threads: 8
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 270347
number of failed transactions: 0 (0.000%)
latency average = 31.227 ms
initial connection time = 1666.517 ms
tps = 9446.867950 (without initial connection time)